Tekla Open API Reference for Tekla Structures 2025
AutoDrawingRule Class
 The AutoDrawingRule class contains the definition of a rule for the Tekla Structures AutoDrawing tool.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.Automation.AutoDrawingRule
 Namespace: Tekla.Structures.Drawing.Automation
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class AutoDrawingRule
<SerializableAttribute>
Public Class AutoDrawingRule
The AutoDrawingRule type exposes the following members.
Constructors
Name | Description
AutoDrawingRule
 Creates a new AutoDrawing rule by using an existing rule file.
Top
Properties
Name | Description
Filename
 The filename of the AutoDrawing script.
Top
See Also
Reference
Tekla.Structures.Drawing.Automation Namespace